In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
obj = pd.Series([1,5, 10, 4])
obj

0     1
1     5
2    10
3     4
dtype: int64

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj.values

array([ 1,  5, 10,  4])

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2["b"]

7

In [9]:
obj2[["b", "a"]]

b    7
a   -5
dtype: int64

In [12]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [15]:
obj2.max()

7

In [16]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [17]:
7 in obj2

False

In [18]:
"b" in obj2

True

In [20]:
7 in obj2.values

True

In [21]:
sdata = {"Istanbul": 18000000, "Izmir": 4500000,
         "Bursa": 1800000, "Ankara": 5500000}

obj3 = pd.Series(sdata)
obj3

Istanbul    18000000
Izmir        4500000
Bursa        1800000
Ankara       5500000
dtype: int64

In [22]:
sdata2 = {"Ankara": 6000000, "Istanbul": 20000000,
         "Izmir": 4800000, "Bursa": 2000000}

obj4 = pd.Series(sdata2)
obj4

Ankara       6000000
Istanbul    20000000
Izmir        4800000
Bursa        2000000
dtype: int64

In [24]:
(obj3 + obj4) / 2

Ankara       5750000.0
Bursa        1900000.0
Istanbul    19000000.0
Izmir        4650000.0
dtype: float64

In [26]:
d = {
    "Name": ["John", "Alice", "Jack", "Rose", "Alex", "David"],
    "Age": [32, 23, 21, 35, 45, 48],
    "City": ["Istanbul", "Paris", "London", "Madrid", "Sao Paulo", "Miami"]
}

data = pd.DataFrame(d)
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [27]:
data.shape

(6, 3)

In [28]:
data.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [29]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [30]:
data.values

array([['John', 32, 'Istanbul'],
       ['Alice', 23, 'Paris'],
       ['Jack', 21, 'London'],
       ['Rose', 35, 'Madrid'],
       ['Alex', 45, 'Sao Paulo'],
       ['David', 48, 'Miami']], dtype=object)

In [31]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [32]:
data.head() # displays first 5 rows

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo

In [33]:
data.head(3)

    Name  Age      City
0   John   32  Istanbul
1  Alice   23     Paris
2   Jack   21    London

In [34]:
data.tail() # display last 5 rows

    Name  Age       City
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [35]:
data.tail(2)

    Name  Age       City
4   Alex   45  Sao Paulo
5  David   48      Miami

In [37]:
type(data)

pandas.core.frame.DataFrame

In [38]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [39]:
data["City"]

0     Istanbul
1        Paris
2       London
3       Madrid
4    Sao Paulo
5        Miami
Name: City, dtype: object

In [40]:
type(data["City"])

pandas.core.series.Series

In [42]:
data[["City", "Age"]]

        City  Age
0   Istanbul   32
1      Paris   23
2     London   21
3     Madrid   35
4  Sao Paulo   45
5      Miami   48

In [43]:
data["City"] # returns a Series object

0     Istanbul
1        Paris
2       London
3       Madrid
4    Sao Paulo
5        Miami
Name: City, dtype: object

In [44]:
data[["City"]]  # returns a DataFrame object

        City
0   Istanbul
1      Paris
2     London
3     Madrid
4  Sao Paulo
5      Miami

In [45]:
data.City # data["City"]

0     Istanbul
1        Paris
2       London
3       Madrid
4    Sao Paulo
5        Miami
Name: City, dtype: object

In [46]:
data.shape

(6, 3)

In [47]:
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami']}

In [48]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [49]:
data["debt"] = 23.5
data

    Name  Age       City  debt
0   John   32   Istanbul  23.5
1  Alice   23      Paris  23.5
2   Jack   21     London  23.5
3   Rose   35     Madrid  23.5
4   Alex   45  Sao Paulo  23.5
5  David   48      Miami  23.5

In [50]:
data["Country"] = ["Turkiye", "France", "UK", "Spain", "Brazil", "US"]
data

    Name  Age       City  debt  Country
0   John   32   Istanbul  23.5  Turkiye
1  Alice   23      Paris  23.5   France
2   Jack   21     London  23.5       UK
3   Rose   35     Madrid  23.5    Spain
4   Alex   45  Sao Paulo  23.5   Brazil
5  David   48      Miami  23.5       US

In [51]:
data["Country"] = ["Turkiye", "France", "United Kingdom", "Spain", "Brazil", "US"]
data

    Name  Age       City  debt         Country
0   John   32   Istanbul  23.5         Turkiye
1  Alice   23      Paris  23.5          France
2   Jack   21     London  23.5  United Kingdom
3   Rose   35     Madrid  23.5           Spain
4   Alex   45  Sao Paulo  23.5          Brazil
5  David   48      Miami  23.5              US

In [57]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
data["debt"] = val
data

    Name  Age       City  debt         Country
0   John   32   Istanbul   NaN         Turkiye
1  Alice   23      Paris   NaN          France
2   Jack   21     London  -1.2  United Kingdom
3   Rose   35     Madrid   NaN           Spain
4   Alex   45  Sao Paulo  -1.5          Brazil
5  David   48      Miami  -1.7              US

In [58]:
data.drop("Name", axis=1)

   Age       City  debt         Country
0   32   Istanbul   NaN         Turkiye
1   23      Paris   NaN          France
2   21     London  -1.2  United Kingdom
3   35     Madrid   NaN           Spain
4   45  Sao Paulo  -1.5          Brazil
5   48      Miami  -1.7              US

In [59]:
data

    Name  Age       City  debt         Country
0   John   32   Istanbul   NaN         Turkiye
1  Alice   23      Paris   NaN          France
2   Jack   21     London  -1.2  United Kingdom
3   Rose   35     Madrid   NaN           Spain
4   Alex   45  Sao Paulo  -1.5          Brazil
5  David   48      Miami  -1.7              US

In [60]:
data.drop("Name", axis=1, inplace=True)

In [61]:
data

   Age       City  debt         Country
0   32   Istanbul   NaN         Turkiye
1   23      Paris   NaN          France
2   21     London  -1.2  United Kingdom
3   35     Madrid   NaN           Spain
4   45  Sao Paulo  -1.5          Brazil
5   48      Miami  -1.7              US

In [62]:
data.drop(["debt", "Country"], axis=1, inplace=True)
data

   Age       City
0   32   Istanbul
1   23      Paris
2   21     London
3   35     Madrid
4   45  Sao Paulo
5   48      Miami

In [63]:
data.drop(2, axis=0, inplace=True)
data

   Age       City
0   32   Istanbul
1   23      Paris
3   35     Madrid
4   45  Sao Paulo
5   48      Miami

In [64]:
data.index

Index([0, 1, 3, 4, 5], dtype='int64')

In [66]:
orders = pd.read_table("http://bit.ly/chiporders")
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [67]:
orders.shape

(4622, 5)

In [68]:
orders.dtypes # data types

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [69]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [70]:
orders.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [71]:
orders.describe(include="object")

           item_name choice_description item_price
count           4622               3376       4622
unique            50               1043         78
top     Chicken Bowl        [Diet Coke]     $8.75
freq             726                134        730

In [72]:
orders.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

In [74]:
orders[["item_name", "choice_description"]].describe(include="object")

           item_name choice_description
count           4622               3376
unique            50               1043
top     Chicken Bowl        [Diet Coke]
freq             726                134

In [76]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [78]:
orders.select_dtypes(include="object").head()

,item_name,choice_description,item_price
0,Chips and Fresh Tomato Salsa,NaN,$2.39
1,Izze,[Clementine],$3.39
2,Nantucket Nectar,[Apple],$3.39
3,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [79]:
orders.select_dtypes(exclude="object").head()

   order_id  quantity
0         1         1
1         1         1
2         1         1
3         1         1
4         2         2

In [87]:
users = pd.read_table("http://bit.ly/movieusers",
                      header=None,
                      sep="|",
                      names=["ID", "Age", "Gender", "Occ", "Zip Code"])
#users.columns = ["ID", "Age", "Gender", "Occ", "Zip Code"]
users.head()

   ID  Age Gender         Occ Zip Code
0   1   24      M  technician    85711
1   2   53      F       other    94043
2   3   23      M      writer    32067
3   4   24      M  technician    43537
4   5   33      F       other    15213

In [91]:
users[["ID", "Gender", "Occ"]][:3]

   ID Gender         Occ
0   1      M  technician
1   2      F       other
2   3      M      writer

In [92]:
users[["ID", "Gender", "Occ"]].head(3)

   ID Gender         Occ
0   1      M  technician
1   2      F       other
2   3      M      writer

In [94]:
# users[["ID", "Gender", "Occ"]][:3] # changing the direction
users[:3][["ID", "Gender", "Occ"]]

   ID Gender         Occ
0   1      M  technician
1   2      F       other
2   3      M      writer

In [96]:
#movies = pd.read_table("http://bit.ly/imdbratings", sep=",")
movies = pd.read_csv("http://bit.ly/imdbratings")
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [97]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [100]:
movies["duration"].sort_values(ascending=False)

476    242
157    238
78     229
142    224
445    220
      ...
293     68
88      68
258     67
338     66
389     64
Name: duration, Length: 979, dtype: int64

In [103]:
# get the duration of the longest movie
movies["duration"].sort_values(ascending=False).values[0]

242

In [106]:
# get the index of the longest movie
movies["duration"].sort_values(ascending=False).index[0]

476

In [109]:
movies.sort_values("duration", ascending=False)

,star_rating,title,content_rating,genre,duration,actors_list
476,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."
157,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
78,8.4,Once Upon a Time in America,R,Crime,229,"[u'Robert De Niro', u'James Woods', u'Elizabet..."
142,8.3,Lagaan: Once Upon a Time in India,PG,Adventure,224,"[u'Aamir Khan', u'Gracy Singh', u'Rachel Shell..."
445,7.9,The Ten Commandments,APPROVED,Adventure,220,"[u'Charlton Heston', u'Yul Brynner', u'Anne Ba..."
...,...,...,...,...,...,...
293,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"
88,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."
258,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
338,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
389,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."

In [113]:
movies.sort_values("duration", ascending=False)["title"].values[0]

'Hamlet'

In [114]:
movies.sort_values("duration", ascending=False)["title"].values[:3]

array(['Hamlet', 'Gone with the Wind', 'Once Upon a Time in America'],
      dtype=object)